<script lang="ts">
	import ComparisonTable from '$components/ComparisonTable/ComparisonTable.svelte';
	import VotingResultTag from '$components/VotingResultTag/VotingResultTag.svelte';
	import { DefaultVotingResult } from '$models/voting';
	import GrayBox from '../GrayBox.svelte';
	import VerticalGrayLine from '../VerticalGrayLine.svelte';
	import VoteOutcomeBox from '../VoteOutcomeBox.svelte';
	import { proposerComparisonTableData } from '../data';
	import {
		DIVIDER_CLASS,
		HEADING_CLASS,
		LIST_CLASS,
		ORDERED_LIST_CLASS,
		SECTION_CLASS
	} from '../styles';
</script>

<section class={SECTION_CLASS}>
	<h1 class="fluid-heading-05 {HEADING_CLASS}" id="ขั้นตอนการออกกฎหมายโดยรัฐสภา">
		ขั้นตอนการออกกฎหมายโดยรัฐสภา
	</h1>
	<div>
		<h2 class="fluid-heading-04 {HEADING_CLASS}" id="ขั้นตอนทั่วไป">ขั้นตอนทั่วไป</h2>
		<hr class="{DIVIDER_CLASS} mb-6" />
		<p>
			ขั้นตอนการพิจารณาร่างกฎหมายแต่ละประเภทจะมีความแตกต่างกันในบางรายละเอียด แต่โดยทั่วไปแล้ว
			กระบวนการออกกฎหมายโดยรัฐสภา อย่างเช่นการออก พ.ร.บ.หรือการอนุมัติ พ.ร.ก.จะดำเนินการผ่าน <strong
				>5 ขั้นตอน</strong
			>ดังต่อไปนี้
		</p>
		<div class="flex w-full items-center justify-center pt-4">
			<img src="images/legislative-process/general-process.webp" alt="" class="max-w-[440px]" />
		</div>
		<div class="py-6">
			<h3 class="fluid-heading-03 {HEADING_CLASS}" id="การเสนอร่างกฎหมาย">1. การเสนอร่างกฎหมาย</h3>
			<p class="py-4">ผู้มีสิทธิเสนอร่างกฎหมาย และลำดับชั้นของกฎหมายที่เสนอได้</p>
			<ComparisonTable {proposerComparisonTableData} />
		</div>
		<div>
			<h3 class="fluid-heading-03 {HEADING_CLASS}">2. การพิจารณาโดยสภาผู้แทนราษฏร</h3>
			<p>
				เมื่อร่างกฎหมายถูกเสนอเข้าสู่สภาแล้ว จะเข้าสู่ขั้นตอนต่อไปคือการพิจารณาโดย
				สส.ในขั้นตอนนี้จะแบ่งเป็น 3 วาระ ได้แก่
			</p>
			<h4 class="heading-02 {HEADING_CLASS}">2.1. วาระที่หนึ่ง : ขั้นรับหลักการ</h4>
			<p>
				เป็นการพิจารณาหลักการของร่างกฎหมาย ผู้เสนอฯ ต้องชี้แจงความจำเป็นที่ต้องออกกฎหมายนั้นๆ
				ในกระบวนการพิจารณา สส.ในสภาจะอภิปรายเหตุผล ถามข้อสงสัยและตั้งข้อสังเกต
				แล้วจึงขอมติในที่ประชุมว่าจะรับหลักการหรือไม่
			</p>
			<GrayBox title="วิธีการพิจารณา">
				<p class="body-02">
					สส.ในสภาจะอภิปรายเหตุผล ถามข้อสงสัยและตั้งข้อสังเกต <br />
					แล้วจึงขอมติในที่ประชุมว่าจะรับหลักการหรือไม่
				</p>
			</GrayBox>
			<VoteOutcomeBox
				passedDescription="ร่างกฎหมายจะถูกนำไปพิจารณาวาระที่สอง"
				failedDescription="ร่างกฎหมายนั้นก็จะตกไปและไม่ถูกพิจารณาต่อ"
			/>
			<h4 class="heading-02 {HEADING_CLASS}">2.2. วาระที่สอง : ขั้นกรรมาธิการ</h4>
			<p class="body-02">
				เป็นการพิจารณาร่างกฎหมายเป็นรายมาตรา อาจเพิ่ม
				ตัดทอนหรือแก้ไขบางมาตราหรือเปลี่ยนถ้อยคำให้สมบูรณ์ขึ้น
				แต่ต้องไม่ขัดแย้งกับหลักการของร่างกฎหมายฉบับนั้น
			</p>
			<GrayBox title="วิธีการพิจารณา" titleClass="mb-2">
				<ul class="body-02 {LIST_CLASS}">
					<li>
						ร่างกฎหมายจะถูกพิจารณาโดย <strong class="heading-02">‘คณะกรรมาธิการสามัญ’</strong>
						ซึ่งมี สส.<br /> เป็นกรรมาธิการในการพิจารณาร่างกฎหมายในด้านที่เกี่ยวข้อง <br />
						หรืออาจตั้งขึ้นใหม่เป็นการเฉพาะเรียกว่า
						<strong class="heading-02">‘คณะกรรมาธิการวิสามัญ’</strong> <br /> ซึ่งบุคคลภายนอกสามารถเข้าร่วมเป็นกรรมาธิการได้
					</li>
					<li>
						ในบางกรณี สภาอาจให้ สส.ทุกคนร่วมพิจารณา เรียกว่า <strong class="heading-02"
							>‘คณะกรรมาธิการเต็มสภา’</strong
						>
					</li>
					<li>
						สส.ที่ไม่เป็นกรรมาธิการสามารถขอแก้ไขเพิ่มเติมร่างกฎหมายได้ โดยเสนอคำขอ
						<strong class="heading-02">‘แปรญัติ’</strong>
						ต่อประธานคณะกรรมาธิการภายใน 7 วัน หลังผ่านวาระแรก <br />
						ซึ่งก็ขึ้นอยู่กับคณะกรรมาธิการว่าจะแก้ไขตามหรือไม่
					</li>
					<li>
						เมื่อคณะกรรมาธิการพิจารณาเสร็จแล้วให้นำร่างกฎหมายเข้าที่ประชุมสภาอีกครั้ง โดย สส.<br />
						ทั้งสภาจะมาอภิปรายร่างกฎหมายตามประเด็นที่มีการแก้ไข <br />
						จากนั้นจะลงมติเห็นชอบโดยใช้เสียงข้างมาก เรียงตามมาตราจนครบ <br />
						จึงให้สภาพิจารณาวาระที่สามต่อไป
					</li>
				</ul>
			</GrayBox>
			<h4 class="heading-02 {HEADING_CLASS}">2.3. วาระที่สาม : ขั้นลงมติเห็นชอบ</h4>
			<p class="body-02">
				เป็นการลงมติเห็นชอบร่างกฎหมายทั้งฉบับ ไม่มีการอภิปรายหรือแก้ไขข้อความใดๆ
			</p>
			<VoteOutcomeBox
				passedDescription="นำไปสู่การพิจารณาของ สว."
				failedDescription="ร่างกฎหมายนั้นเป็นอันตกไป"
			/>
		</div>
		<div>
			<h3 class="fluid-heading-03 {HEADING_CLASS}">3. การพิจารณาร่างกฎหมายโดยวุฒิสภา</h3>
			<p class="body-02">
				เมื่อ สส.มีมติเห็นชอบ ร่างกฎหมายจะถูกส่งต่อไปยัง สว.โดยการพิจารณาจะมี 3 วาระเช่นเดียวกัน
				แต่มีเงื่อนไขว่าต้องเสร็จภายในเวลาที่กำหนดไว้
			</p>
			<p class="body-02">
				หากเกินระยะเวลาที่กำหนดจะถือว่าเห็นชอบร่างกฎหมายฉบับนั้น ซึ่งเงื่อนไขถูกระบุไว้ว่า
			</p>
			<ul class="body-02 {LIST_CLASS}">
				<li>ร่างกฎหมายทั่วไปต้องพิจารณาให้เสร็จภายใน 60 วัน</li>
				<li>ร่างกฎหมายที่เกี่ยวกับการเงินต้องพิจารณาให้เสร็จภายใน 30 วัน</li>
				<li>ทั้งนี้ สว.สามารถลงมติขยายเวลาออกไปเป็นกรณีพิเศษได้ไม่เกิน 30 วัน</li>
			</ul>
			<GrayBox title="ผลลัพธ์" titleClass="mb-2">
				<p class="body-02">
					สว.<strong class="heading-02">ไม่มีอำนาจ ‘ปัดตก’</strong> หรือทำให้ร่างกฎหมายที่
					สส.มีมติเห็นชอบแล้วหายไปได้ แต่ สว.<strong class="heading-02">สามารถเพิ่มขั้นตอน</strong
					>ในการพิจารณาร่างกฎหมายได้ เมื่อ สว.พิจารณาร่างกฎหมายแล้วสามารถลงมติได้ 3 กรณี
				</p>

				<div class="body-01 mt-2 flex w-full flex-col md:flex-row">
					<div class="w-full md:w-4/12">
						<VotingResultTag class="m-0" result={DefaultVotingResult.Passed} />
						<p class="body-01">เตรียมนำร่างกฎหมายฯ <br /> เข้าสู่ขั้นตอนประกาศใช้</p>
					</div>
					<VerticalGrayLine />
					<div class="w-full pt-2 md:w-4/12 md:px-2 md:pt-0">
						<h5 class="heading-01">แก้ไขเพิ่มเติม</h5>
						<div class="label-01 mb-2 mt-2 text-gray-60">
							โดยลงมติ
							<VotingResultTag class="m-0" result={DefaultVotingResult.Passed} /> <br />
							ให้กับมติที่นำไปสู่การแก้ไขเพิ่มเติม
						</div>
						<ul class={LIST_CLASS}>
							<li>
								ให้ส่งร่างที่แก้ไขเพิ่มเติมให้ สส.เห็นชอบ หรือตั้ง <br />
								<strong class="heading-compact-01">‘คณะกรรมาธิการร่วม’</strong> <br />
								ของสองสภาขึ้นมาพิจารณา โดยต้องมีจำนวน สส.และ สว.เท่ากัน
							</li>
							<li>เมื่อกรรมาธิการร่วมพิจารณาร่างกฎหมายเสร็จแล้วให้เสนอต่อทั้งสองสภา</li>
							<li>ให้ดำเนินขั้นตอนประกาศใช้เป็นกฎหมาย</li>
							<li>
								แต่ถ้าสภาใดสภาหนึ่งไม่เห็นชอบ ให้ยับยั้งร่างกฎหมายนั้นไว้ก่อน ซึ่ง
								สส.อาจยกขึ้นมาพิจารณาใหม่ได้หลัง 180 วัน โดยอาจยืนยันร่างฯ เดิม หรือร่างฯ
								ที่คณะกรรมาธิการร่วมกันพิจารณาก็ได้
							</li>
						</ul>
					</div>
					<VerticalGrayLine />
					<div class="w-full pt-2 md:w-4/12 md:px-2 md:pt-0">
						<VotingResultTag class="m-0" result={DefaultVotingResult.Failed} />
						<ul class={LIST_CLASS}>
							<li>ให้ ‘ยับยั้ง’ ไว้</li>
							<li>เมื่อพ้นระยะเวลา 180 วัน สส.สามารถยกร่างกฎหมายฉบับนั้นกลับมาพิจารณาใหม่ได้</li>
							<li>
								หาก สส.ยืนยันร่างฯ <br />
								ฉบับเดิมด้วยคะแนนเสียงมากกว่ากึ่งหนึ่งของสภาผู้แทนฯ ให้ถือว่าร่างฯ ฉบับนั้นได้รับความเห็นชอบ
								และเตรียมประกาศใช้เป็นกฎหมาย
							</li>
						</ul>
					</div>
				</div>
			</GrayBox>
		</div>
		<div>
			<h3 class="fluid-heading-03 {HEADING_CLASS}">4. ศาลรัฐธรรมนูญวินิจฉัยร่างกฎหมาย</h3>
			<p class="body-02">
				โดยทั่วไป เมื่อร่างกฎหมายได้รับความเห็นชอบจากรัฐสภาแล้ว ก็จะเข้าสู่ขั้นตอนการประกาศใช้
				แต่ถ้าหากนายกรัฐมนตรี หรือ สมาชิกไม่น้อยกว่า 1 ใน 10 ของแต่ละสภาหรือทั้งสองสภารวมกัน
				เห็นว่าร่างกฎหมายขัดหรือแย้งต่อรัฐธรรมนูญ ให้ส่งศาลรัฐธรรมนูญเพื่อวินิฉัย
			</p>
			<GrayBox title="ผลลัพธ์" titleClass="mb-2">
				<div class="body-01 flex w-full flex-col md:flex-row">
					<div class="w-full md:w-4/12">
						<VotingResultTag class="m-0" result={DefaultVotingResult.Passed} />
						<p class="body-01">ถ้าไม่มีข้อความที่ขัดต่อรัฐธรรมนูญ</p>
					</div>
					<VerticalGrayLine />
					<div class="w-full pt-2 md:w-4/12 md:pt-0">
						<h5 class="heading-01 mb-2">แก้ไขเพิ่มเติม</h5>
						<p class="body-01">ถ้ามีข้อความที่ขัดต่อรัฐธรรมนูญ</p>
					</div>
					<VerticalGrayLine />
					<div class="w-full pt-2 md:w-4/12 md:pt-0">
						<VotingResultTag class="m-0" result={DefaultVotingResult.Failed} />
						<p class="body-01">ถ้ามีข้อความที่ขัดต่อรัฐธรรมนูญและเป็นสาระสำคัญของร่าง</p>
					</div>
				</div>
			</GrayBox>
		</div>
		<div>
			<h3 class="fluid-heading-03 {HEADING_CLASS}">5. การประกาศใช้เป็นกฎหมาย</h3>
			<p class="body-02">
				เมื่อร่างกฎหมายได้รับความเห็นชอบจากรัฐสภาแล้ว ให้นายกรัฐมนตรีรอไว้ 5 วัน
				แล้วให้ขึ้นทูลเกล้าฯ เพื่อให้พระมหากษัตริย์ทรงลงพระปรมาภิไธยภายใน 20 วัน
				จากนั้นให้ประกาศในราชกิจจานุเบกษาให้มีผลบังคับใช้เป็นกฎหมายได้
			</p>
		</div>
	</div>
	<div class="mb-6">
		<h2 class="fluid-heading-04 {HEADING_CLASS}" id="ขั้นตอนพิเศษของกฎหมายบางประเภท">
			ขั้นตอนพิเศษของกฎหมายบางประเภท
		</h2>
		<hr class={DIVIDER_CLASS} />
		<p class="my-6">
			ในกระบวนการออกกฎหมายหรือแก้กฎหมายบางประเภทจะใช้ <strong
				>‘การประชุมร่วมกันของรัฐสภา’ หรือ สส.และ สว.ประชุมพิจารณาร่วมกัน</strong
			>
			และ <strong>มีเงื่อนไขเพิ่มเติม</strong> ได้แก่
		</p>
		<div class="body-02 mt-10">
			<h3 class="fluid-heading-03 {HEADING_CLASS}">การพิจารณาร่าง พ.ร.ป.</h3>
			<p>
				ขั้นตอนในการพิจารณาร่าง พ.ร.ป.จะดำเนินในรูปแบบเดียวกันกับการออก พ.ร.บ.เว้นแต่ใน<strong
					>เงื่อนไขเพิ่มเติม</strong
				>ต่อไปนี้
			</p>
			<img
				class="mx-auto my-4 w-full max-w-[440px]"
				src="images/legislative-process/organic-law-bill-consideration.webp"
				alt=""
			/>
			<ol class="ml-6 {ORDERED_LIST_CLASS}">
				<li class="mb-2">
					การพิจารณาโดยสภาร่วม (สส. + สว.) ต้องพิจารณา 3 วาระให้เสร็จภายใน 180 วัน
				</li>
				<li class="mb-2">
					ในวาระที่ 3
					ต้องมีคะแนนเสียงเห็นชอบด้วยมากกว่ากึ่งหนึ่งของจํานวนสมาชิกทั้งหมดเท่าที่มีอยู่ของรัฐสภา
				</li>
				<li class="mb-2">
					เมื่อรัฐสภา ‘เห็นชอบ’ ให้ส่งร่าง พ.ร.ป.ไปยังศาลฎีกา ศาลรัฐธรรมนูญ
					หรือองค์กรอิสระที่เกี่ยวข้องภายใน 15 วัน เพื่อให้ความเห็น
					<ul class={LIST_CLASS}>
						<li>หากไม่มีข้อทักท้วงภายใน 10 วัน ให้รัฐสภาดําเนินการต่อไป</li>
						<li>
							มีข้อความขัดต่อรัฐธรรมนูญ ให้เสนอความเห็นไปยังรัฐสภา
							และให้รัฐสภาประชุมร่วมกันเพื่อพิจารณาให้แล้วเสร็จภายใน 30 วัน
							โดยสามารถแก้ไขตามที่เห็นสมควร
							จากนั้นให้รัฐสภาดําเนินการต่อไปในวิธีการเดียวกันกับการตรา พ.ร.บ.
						</li>
					</ul>
				</li>
			</ol>
		</div>
		<div class="body-02 mt-10">
			<h3 class="fluid-heading-03 {HEADING_CLASS}">การแก้ไขบทบัญญัติในรัฐธรรมนูญ</h3>
			<p>
				เมื่อเข้าสู่ขั้นตอนการพิจารณาของรัฐสภา การประชุมร่วมกันจะมีทั้งหมด 3 วาระ
				เช่นเดียวกันกับการออก พ.ร.บ.แต่ปรากฏ<strong>เงื่อนไขเพิ่มเติม</strong>ดังนี้
			</p>
			<img
				class="mx-auto my-4 w-full max-w-[440px]"
				src="images/legislative-process/amendment-of-constitutional-provisions.webp"
				alt=""
			/>
			<ol class="ml-6 gap-2 {ORDERED_LIST_CLASS}">
				<li class="mb-2">
					ในวาระที่หนึ่ง ต้องใช้เสียงไม่น้อยกว่าครึ่งหนึ่งของสมาชิกเท่าที่มีอยู่ของสองสภาแล้ว
					ในจำนวนนี้ต้องได้เสียง<strong>เห็นชอบจาก สว.ไม่น้อยกว่า 1 ใน 3</strong> ของจำนวน สว.ที่มีอยู่
				</li>
				<li class="mb-2">
					ในวาระที่สอง การลงมติให้ถือเสียงข้างมากเป็นประมาณ
					<strong
						>หากเป็นการแก้ไขที่ประชาชนเป็นผู้เสนอ ต้องเปิดโอกาสให้ผู้แทนประชาชนเสนอความคิดเห็นด้วย</strong
					> จากนั้นรอ 15 วัน จึงเข้าวาระที่สาม
				</li>
				<li class="mb-2">
					ในวาระที่สาม การลงมติ ‘เห็นชอบ’ ต้องประกอบด้วย
					<ul class={LIST_CLASS}>
						<li>
							เสียงเห็นชอบมากกว่า<strong>ครึ่งหนึ่งของสมาชิก</strong>เท่าที่มีอยู่ของสองสภา
						</li>
						<li>เสียงเห็นชอบจาก สว.ไม่น้อยกว่า <strong>1 ใน 3 ของจำนวน สว.</strong></li>
						<li>
							เสียงเห็นชอบ สส.จากพรรคที่ไม่มีสมาชิกเป็นรัฐมนตรี ประธานสภาหรือรองประธานผู้แทนฯ หรือ
							<strong>‘สส.ฝ่ายค้าน’ ไม่น้อยกว่าร้อยละ 20</strong>
							ของทุกพรรคการเมืองดังกล่าวรวมกัน
						</li>
					</ul>
					เมื่อมีมติเห็นชอบให้รอไว้ 15 วันและนำขึ้นทูลเกล้าฯ ถวาย
				</li>
				<li class="mb-2">
					ในกรณีที่มีการแก้ไขเกี่ยวกับ บททั่วไป พระมหากษัตริย์ การแก้ไขเพิ่มเติมรัฐธรรมนูญ
					คุณสมบัติหรือลักษณะต้องห้ามของผู้ดำรงตำแหน่งต่างๆ หรืออำนาจหน้าที่ของศาลหรือองค์กรอิสระ
					ให้<strong>จัดทำประชามติ</strong>เพื่อเห็นชอบก่อน จึงจะสามารถประกาศใช้ได้
				</li>
				<li class="mb-2">
					ในระหว่างนี้ สส.หรือ สว.หรือทั้งสองสภารวมกัน <strong>จำนวนไม่น้อยกว่า 1 ใน 10</strong>
					สามารถใช้สิทธิเข้าชื่อเสนอให้<strong>ศาลรัฐธรรมนูญวินิจฉัย</strong
					>ว่าร่างแก้ไขรัฐธรรมนูญนั้น เป็นเรื่องเกี่ยวกับการเปลี่ยนแปลงการปกครองหรือไม่
					หรือเป็นเรื่องที่ต้องทำประชามติก่อนหรือไม่ โดยศาลรัฐธรรมนูญต้องพิจารณาให้เสร็จภายใน 30
					วันนับจากวันที่ได้รับเรื่อง โดยในระหว่างนี้ นายกฯ จะนำร่างฯ ขึ้นทูลเกล้าฯ ไม่ได้
				</li>
			</ol>
		</div>
		<div class="body-02 mt-10">
			<h3 class="fluid-heading-03 {HEADING_CLASS}">การพิจารณาร่าง พ.ร.บ.งบประมาณประจำปี</h3>
			<p>
				ขั้นตอนในการพิจารณาร่าง พ.ร.บ.งบประมาณประจำปี จะแตกต่างจากการออก
				พ.ร.บ.ทั่วไปในขั้นตอนการพิจารณาของ สว.โดยมีรายละเอียดดังนี้
			</p>
			<img
				class="mx-auto my-4 w-full max-w-[440px]"
				src="images/legislative-process/yearly.webp"
				alt=""
			/>
			<ol class="ml-6 gap-2 {ORDERED_LIST_CLASS}">
				<li class="mb-2">
					เมื่อ สส.มีมติรับหลักการแห่งร่าง พ.ร.บ.งบประมาณฯ ให้
					สว.ตั้งคณะกรรมาธิการวิสามัญขึ้นคณะหนึ่งเพื่อพิจารณาศึกษาร่าง พ.ร.บ.งบประมาณฯ
					ควบคู่กับการพิจารณาของ สส.และรายงานผลการพิจารณาพร้อมข้อสังเกตและข้อเสนอแนะต่อประธานวุฒิสภา
				</li>
				<li class="mb-2">
					สว.ต้องพิจารณาให้ความเห็นชอบหรือไม่ให้ความเห็นชอบร่าง พ.ร.บ.งบประมาณภายใน 20 วัน
					นับตั้งแต่วันที่ร่าง พ.ร.บ.มาถึงวุฒิสภา โดยจะแก้ไขเพิ่มเติมใดๆ มิได้
				</li>
			</ol>
		</div>
	</div>
</section>
