import { enumBillStatus } from '$lib/politigraph/genql/schema';

export const sections = [
	{
		menu: 'แนะนำภาพรวม',
		menuItem: [
			{ text: 'การออกกฎหมายตามรัฐธรรมนูญ 2560' },
			{ text: 'กฎหมายบังคับใช้ได้อย่างไร' },
			{ text: 'กฎหมายในเว็บไซต์นี้' },
			{ text: 'ประเภทของกฎหมายที่ผ่านการพิจารณาโดยรัฐสภา' },
			{ text: 'สถานะของกฎหมาย' }
		]
	},
	{
		menu: 'ขั้นตอนการออกกฎหมายโดยรัฐสภา',
		menuItem: [{ text: 'ขั้นตอนทั่วไป' }, { text: 'ขั้นตอนพิเศษของกฎหมายบางประเภท' }]
	},
	{
		menu: 'เข้าใจการลงมติของ สส.และ สว.',
		menuItem: [
			{ text: 'การลงมติคืออะไร เกิดขึ้นในขั้นตอนไหนบ้าง?' },
			{ text: 'วิธีการลงมติ' },
			{ text: 'ประเภทการลงมติ' },
			{ text: 'ผลการลงมติ' }
		]
	},
	{
		menu: 'สส.และ สว.ทำอะไรบ้างในสภา',
		menuItem: [
			{ text: 'หน้าที่ของสมาชิกสภาผู้แทนราษฏร (สส.)' },
			{ text: 'หน้าที่ของสมาชิกวุฒิสภา (สว.)' },
			{ text: 'หน้าที่ของสภาร่วม (สส. + สว.)' }
		]
	}
];

export const billStatuses = [
	{
		billStatus: enumBillStatus.IN_PROGRESS,
		billAmount: 'xxxx',
		descriptionTitle: 'ร่างกฎหมายอยู่ในขั้นตอนใดขั้นตอนหนึ่ง ได้แก่',
		descriptionList: [
			'ถูกเสนอเข้าสภา',
			'สภาผู้แทนฯ พิจารณาวาระที่ 1, 2, 3',
			'วุฒิสภาพิจารณาวาระที่ 1, 2, 3',
			'แก้ไขเพิ่มเติมเพื่อพิจารณาใหม่',
			'รัฐสภาพิจารณา'
		],
		learnMoreLabel: 'สำรวจกฎหมายที่อยู่ในกระบวนการพิจารณา',
		learnMoreUrl: `/bills/explore?status=${enumBillStatus.IN_PROGRESS}`,
		class: 'bg-yellow-10'
	},
	{
		billStatus: enumBillStatus.ENACTED,
		billAmount: 'xxxx',
		descriptionTitle: 'บังคับใช้เมื่อ',
		descriptionList: ['พระมหากษัตริย์ลงพระปรมาภิไธย', 'ประกาศบนราชกิจจานุเบกษา'],
		learnMoreLabel: 'สำรวจกฎหมายที่บังคับใช้',
		learnMoreUrl: `/bills/explore?status=${enumBillStatus.ENACTED}`,
		class: 'bg-teal-10'
	},
	{
		billStatus: enumBillStatus.REJECTED,
		billAmount: 'xxxx',
		descriptionTitle: 'ตัวอย่างสาเหตุที่ทำให้กฎหมายตกไป',
		descriptionList: [
			'นายกรัฐมนตรีไม่รับรอง',
			'สส.มีมติไม่รับหลักการ',
			'สส.มีมติไม่เห็นชอบ',
			'สว.ยับยั้ง และ สส.มีมติไม่เห็นชอบ',
			'ศาลรัฐธรรมนูญวินิจฉัยว่าขัดต่อรัฐธรรมนูญ'
		],
		learnMoreLabel: 'สำรวจกฎหมายที่ตกไป',
		learnMoreUrl: `/bills/explore?status=${enumBillStatus.REJECTED}`,
		class: 'bg-red-10'
	},
	{
		billStatus: enumBillStatus.MERGED,
		billAmount: 'xxxx',
		descriptionTitle:
			'ร่างกฎหมายฉบับหนึ่งสามารถถูกผนวกกับร่างอื่นในรัฐสภา เพื่อพิจารณาออกเป็นกฎหมายบทเดียวกันได้ เมื่อร่างกฎหมายมีวัตถุประสงค์เดียวกัน ซึ่งจะถูกผนวกกับร่างอื่นในชั้นการพิจารณาโดยสภาผู้แทนฯ หรือในสภาร่วม โดยขึ้นอยู่กับว่าเป็นการพิจารณากฎหมายประเภทใด',
		descriptionList: [],
		learnMoreLabel: 'สำรวจกฎหมายที่ถูกรวมร่าง',
		learnMoreUrl: `/bills/explore?status=${enumBillStatus.MERGED}`,
		class: 'bg-purple-10'
	}
];

export const proposerComparisonTableData = [
	{
		'': 'ครม.',
		'ร่าง พ.ร.บ.': 'มีสิทธิเสนอร่าง',
		'ออก พ.ร.ก.': 'มีสิทธิเสนอร่าง',
		'ร่าง พ.ร.ป.': 'มีสิทธิเสนอร่าง',
		'ร่างแก้ไขบทบัญญัติใน รธน.': 'มีสิทธิเสนอร่าง'
	},
	{
		'': 'สส.',
		'ร่าง พ.ร.บ.': '20 คน',
		'ออก พ.ร.ก.': '-',
		'ร่าง พ.ร.ป.': 'สส.ไม่น้อยกว่า 1 ใน 10',
		'ร่างแก้ไขบทบัญญัติใน รธน.': 'สส.ไม่น้อยกว่า 1 ใน 5'
	},
	{
		'': 'สมาชิกรัฐสภา',
		'ร่าง พ.ร.บ.': '-',
		'ออก พ.ร.ก.': '-',
		'ร่าง พ.ร.ป.': '-',
		'ร่างแก้ไขบทบัญญัติใน รธน.': 'สส.และ สว.ไม่น้อยกว่า 1 ใน 5'
	},
	{
		'': 'ประชาชนผู้มีสิทธิเลือกตั้ง',
		'ร่าง พ.ร.บ.': '10,000 คน',
		'ออก พ.ร.ก.': '-',
		'ร่าง พ.ร.ป.': '-',
		'ร่างแก้ไขบทบัญญัติใน รธน.': '50,000 คน'
	}
];
