<script lang="ts">
	import type { Hst } from '@histoire/plugin-svelte';
	import ComparisonTable from './ComparisonTable.svelte';
	export let Hst: Hst;
	let proposerComparisonTableData = [
		{
			'': 'ครม.',
			'ร่าง พรบ.': 'มีสิทธิเสนอร่าง',
			'ออก พรก.': 'มีสิทธิเสนอร่าง',
			'ร่าง พรป.': 'มีสิทธิเสนอร่าง',
			'ร่างแก้ไขบทบัญญัติใน รธน.': 'มีสิทธิเสนอร่าง'
		},
		{
			'': 'สส.',
			'ร่าง พรบ.': '20 คน',
			'ออก พรก.': '-',
			'ร่าง พรป.': 'สส.ไม่น้อยกว่า 1 ใน 10',
			'ร่างแก้ไขบทบัญญัติใน รธน.': 'สส.ไม่น้อยกว่า 1 ใน 5'
		},
		{
			'': 'สมาชิกรัฐสภา',
			'ร่าง พรบ.': '-',
			'ออก พรก.': '-',
			'ร่าง พรป.': '-',
			'ร่างแก้ไขบทบัญญัติใน รธน.': 'สส.ไม่น้อยกว่า 1 ใน 5'
		},
		{
			'': 'ประชาชนผู้มีสิทธิเลือกตั้ง',
			'ร่าง พรบ.': '10,000 คน',
			'ออก พรก.': '-',
			'ร่าง พรป.': '-',
			'ร่างแก้ไขบทบัญญัติใน รธน.': '50,000 คน'
		}
	];
</script>

<Hst.Story title="Table">
	<div class="font-sans body-02"><ComparisonTable {proposerComparisonTableData} /></div>
</Hst.Story>
