<script lang="ts">
	import dayjs from 'dayjs';
	import buddhistEra from 'dayjs/plugin/buddhistEra';
	import 'dayjs/locale/th';
	import Sidebar from '$components/LegislativeProcess/Sidebar.svelte';
	import Collapsible from '$components/LegislativeProcess/Collapsible.svelte';
	dayjs.extend(buddhistEra);
	dayjs.locale('th');
</script>

<div class="flex flex-col w-full">
	<header class="bg-teal-20">
		<div class="w-full max-w-[800px] px-10 py-10 md:py-20 mx-auto">
			<h1 class="fluid-heading-05">ร่างกฎหมายกลายเป็นกฎหมายได้อย่างไร</h1>
			<p>
				<span class="text-text-primary font-bold">อัปเดตล่าสุด :</span>
				<span class="text-helper-text-01">{dayjs(new Date()).format('DD MMM BBBB')}</span>
			</p>
		</div>
	</header>
	<main class="flex flex-col justify-center md:flex-row items-center md:items-start">
		<div
			class="legislative-process-sidebar bg-ui-01 md:bg-white w-full md:w-auto gap-10 px-4 md:px-10 md:py-0 py-8"
		>
			<div class="py-10 w-full bg-white flex items-center justify-center">
				<Sidebar />
			</div>
		</div>
		<div
			class="w-full max-w-[800px] flex flex-col gap-10 px-4 md:px-10 py-8 bg-ui-01 md:bg-white flex-1"
		>
			<section>
				<h1 class="fluid-heading-05" id="แนะนำภาพรวม">แนะนำภาพรวม</h1>
				<div>
					<h2 class="fluid-heading-04" id="การออกกฎหมายตามรัฐธรรมนูญ 2560">
						การออกกฎหมายตามรัฐธรรมนูญ 2560
					</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="กฎหมายบังคับใช้ได้อย่างไร">กฎหมายบังคับใช้ได้อย่างไร</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="กฎหมายในเว็บไซต์นี้">กฎหมายในเว็บไซต์นี้</h2>
					<hr />
				</div>
				<div class="flex flex-col gap-4">
					<div>
						<div class="mb-6">
							<h2 class="fluid-heading-04" id="ประเภทของกฎหมายที่ผ่านการพิจารณาโดยรัฐสภา">
								ประเภทของกฎหมายที่ผ่านการพิจารณาโดยรัฐสภา
							</h2>
							<hr />
						</div>
						<p>
							รัฐสภาประกอบไปด้วยสภาผู้แทนราษฎร และวุฒิสภา
							ทำหน้าที่พิจารณาและกลั่นกรองร่างกฏหมายก่อนการประกาศใช้ ประกอบด้วย
						</p>
					</div>
					<div class="flex flex-col gap-4">
						<Collapsible
							title="ร่างพระราชบัญญัติ (พรบ.)"
							details="กฎหมายโดยทั่วไปจะถูกตราเป็น พ.ร.บ."
							presentedBy={['ครม.', 'สส. 20 คน', 'ประชาชน 10,000 คน']}
							consideredBy={['สส.', 'สว.']}
							endorsedBy={'พระมหากษัตริย์'}
							stepDescription="เมื่อประกาศใช้ พ.ร.ก. แล้ว ในการประชุมรัฐสภาสมัยต่อไป ครม. ต้องเสนอ พ.ร.ก.ที่ประกาศใช้ต่อรัฐสภาเพื่อให้พิจารณาโดยเร็ว ถ้าอยู่นอกสมัยประชุมและประเมินว่าการรอสมัยประชุมสามัญจะเป็นการชักช้า ครม. ต้องเรียกประชุมสมัยวิสามัญเพื่อให้รัฐสภาพิจารณาอนุมัติ การอนุมัติ พ.ร.ก.เป็นกฎหมายนั้น กำหนดว่าหาก ส.ส. ลงคะแนนเสียงไม่ถึงกึ่งหนึ่ง ให้ พ.ร.ก.ฉบับนั้นตกไป แต่ถ้า ส.ส. อนุมัติ แต่ ส.ว.ไม่อนุมัติ แล้ว ส.ส. ยืนยันการอนุมัติด้วยคะแนนเสียงเกินครึ่งหนึ่งของจำนวน สส. ทั้งหมด ก็ให้ พ.ร.ก. มีผลเป็นกฎหมายและประกาศใช้เป็น พ.ร.บ. ต่อไป"
							steps={[
								'ร่างกฎหมายเข้าสภา',
								'ผ่านสภาผู้แทนราษฎร',
								'ผ่านวุฒิสภา',
								'ผ่านศาลรัฐธรรมนูญ (หากมีผู้ร้องเรียน)',
								'พระมหากษัตริย์ลงพระปรมาภิไธย',
								'ประกาศบนราชกิจจานุเบกษา'
							]}
							examples={[
								{
									link: 'https://theyworkforus.wevis.info/votelog/263/',
									description: 'ร่าง พ.ร.บ. กำหนดระยะเวลาดำเนินงานในกระบวนการยุติธรรม (วาระ 1)'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/230/',
									description: 'ร่าง พ.ร.บ. ล้มละลาย (วาระ 1)'
								},
								{
									link: 'http://sql.ldd.go.th/intraaccount/Information_Law/File/Law-10.pdf',
									description: 'พ.ร.บ. ด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2560'
								}
							]}
						/>
						<Collapsible
							title="การอนุมัติพระราชกำหนด (พ.ร.ก.)"
							details="พ.ร.ก. เป็นกฎหมายที่ ครม. ประกาศใช้ในกรณีฉุกเฉินหรือในสภาวะที่มีความจำเป็น โดยไม่ต้องผ่านกระบวนการพิจารณาของรัฐสภาในขั้นแรก เป็นเครื่องมือที่ให้อำนาจฝ่ายบริหารในการตรากฎหมาย เป็นอำนาจเฉพาะของรัฐบาลในยามฉุกเฉิน เมื่อประกาศใช้ พ.ร.ก. แล้ว ครม. ต้องเสนอ พ.ร.ก. ที่ประกาศใช้ต่อรัฐสภาเพื่อให้พิจารณาอนุมัติเป็น พ.ร.บ. โดยเร็ว"
							presentedBy={['ครม.']}
							consideredBy={['สส.', 'สว.']}
							endorsedBy={'พระมหากษัตริย์'}
							stepDescription="หลังประกาศใช้ ครม. ต้องเสนอ พ.ร.ก.ที่ประกาศใช้ต่อรัฐสภาเพื่อให้พิจารณา ในการประชุมรัฐสภาสมัยต่อไป ถ้าอยู่นอกสมัยประชุมและประเมินว่าการรอสมัยประชุมสามัญจะเป็นการชักช้า ครม. ต้องเรียกประชุมสมัยวิสามัญเพื่อให้รัฐสภาพิจารณาอนุมัติ การอนุมัติ พ.ร.ก.เป็นกฎหมายนั้น กำหนดว่าหาก ส.ส. ลงคะแนนเสียงไม่ถึงกึ่งหนึ่ง ให้ พ.ร.ก.ฉบับนั้นตกไป แต่ถ้า ส.ส. อนุมัติ แต่ ส.ว.ไม่อนุมัติ แล้ว ส.ส. ยืนยันการอนุมัติด้วยคะแนนเสียงเกินครึ่งหนึ่งของจำนวน สส. ทั้งหมด ก็ให้ พ.ร.ก. มีผลเป็นกฎหมายและประกาศใช้เป็น พ.ร.บ. ต่อไป"
							steps={[
								'ครม. เสนอร่าง พ.ร.ก.',
								'พระมหากษัตริย์ลงพระปรมาภิไธย',
								'บังคับใช้ พ.ร.ก.',
								'ผ่านศาลรัฐธรรมนูญ (หากมีผู้ร้องเรียน)',
								'ผ่านสภาผู้แทนราษฎร',
								'ประกาศใช้เป็น พ.ร.บ. บนราชกิจจานุเบกษา'
							]}
							examples={[
								{
									link: 'https://theyworkforus.wevis.info/votelog/152/',
									description: 'อนุมัติ พ.ร.ก. พิกัดอัตราศุลกากร'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/83/',
									description: 'อนุมัติ พ.ร.ก. เงินกู้โควิด-19 (ห้าแสนล้านบาท)'
								},
								{
									link: 'https://www4.fisheries.go.th/file_footer/20160517105511_file.pdf',
									description: 'พ.ร.ก.การประมง พ.ศ. 2558'
								}
							]}
						/>
						<Collapsible
							title="ร่างแก้ไขรัฐธรรมนูญ"
							details="รัฐธรรมนูญเป็นกฎหมายสูงสุด การแก้ไขเพิ่มเติมรัฐธรรมนูญจึงมีกระบวนการไว้เป็นการเฉพาะและมีวิธีการแก้ไขที่ซับซ้อน โดยเฉพาะเงื่อนไขที่ต้องมีเสียง ส.ว. 1 ใน 3 หรือ 84 คน และ สส. ฝ่ายค้าน 20% ในจำนวนเสียงครึ่งหนึ่งของสองสภาที่ใช้ลงมติเห็นชอบแก้ไขรัฐธรรมนูญ นอกจากนี้ ยังบังคับให้ทำประชามติถ้าจะแก้ไขในประเด็น บททั่วไป พระมหากษัตริย์ วิธีแก้ไขรัฐธรรมนูญ คุณสมบัตินักการเมือง อำนาจศาลและองค์กรอิสระ อีกทั้ง ยังให้อำนาจศาลรัฐธรรมนูญในการยับยั้งการแก้ไข หากมีสมาชิกรัฐสภาร้องเรียน"
							presentedBy={['ครม.', 'สส. 1 ใน 5', 'สส. + สว. 1 ใน 5', 'ประชาชน 50,000 คน']}
							consideredBy={'สภาร่วม (สส.+สว.)'}
							endorsedBy={'พระมหากษัตริย์'}
							steps={[
								'ร่างแก้ไขรัฐธรรมนูญเข้าสภา',
								'ผ่านประชุมร่วมกันของรัฐสภา (สส.+สว.)',
								'ประชามติแก้ไขรัฐธรรมนูญ (ในประเด็นที่กำหนด)',
								'ผ่านศาลรัฐธรรมนูญ (หากมีผู้ร้องเรียน)',
								'พระมหากษัตริย์ลงพระปรมาภิไธย',
								'ประกาศบนราชกิจจานุเบกษา'
							]}
							examples={[
								{
									link: 'https://theyworkforus.wevis.info/votelog/262/',
									description: 'แก้ รธน. ปลดล็อคท้องถิ่น (คณะก้าวหน้า) (วาระ 1)'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/45/',
									description:
										'แก้ รธน. ฉบับที่ 7 ร่างประชาชน รื้อ สร้าง ร่าง รัฐธรรมนูญใหม่ (โหวต 7 ฉบับ)'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/291/',
									description: 'แก้ รธน. เพิ่มสิทธิพื้นฐาน (เพื่อไทย) (วาระ 1)'
								}
							]}
						/>
						<Collapsible
							title="ร่างพระราชบัญญัติประกอบรัฐธรรมนูญ (ร่าง พ.ร.ป.)"
							details="พ.ร.ป. เป็นกฎหมายประกอบรัฐธรรมนูญที่ตราขึ้นในรูปแบบ พ.ร.บ. ซึ่งเป็นส่วนหนึ่งของรัฐธรรมนูญที่ทำหน้าที่อธิบายขยายความและกำหนดรายละเอียดสาระสำคัญของเรื่องต่างๆ ในรัฐธรรมนูญตามที่รัฐธรรมนูญกำหนดเพื่อให้มีความสมบูรณ์ครบถ้วนและชัดเจนยิ่งขึ้น โดยในรัฐธรรมนูญ 2560 มาตรา 130 ระบุให้มี พ.ร.ป. ทั้งสิ้น 10 ฉบับ ตัวอย่างเช่น พ.ร.ป ว่าด้วยพรรคการเมือง พ.ร.ป ว่าด้วยการตรวจเงินแผ่นดิน พ.ร.ป. ว่าด้วยการได้มาซึ่ง สว. เป็นต้น"
							presentedBy={['ครม.', 'สส. 1 ใน 10']}
							consideredBy={'สภาร่วม (สส.+สว.)'}
							endorsedBy={'พระมหากษัตริย์'}
							steps={[
								'ร่าง พ.ร.ป. เข้าสภา',
								'ผ่านประชุมร่วมกันของรัฐสภา (สส.+สว.)',
								'รัฐสภาส่งร่าง พ.ร.ป. ให้องค์กรที่เกี่ยวข้องให้ความเห็น',
								'ผ่านศาลรัฐธรรมนูญ (หากมีผู้ร้องเรียน)',
								'พระมหากษัตริย์ลงพระปรมาภิไธย',
								'ประกาศบนราชกิจจานุเบกษา'
							]}
							examples={[
								{
									link: 'https://theyworkforus.wevis.info/votelog/177/',
									description: 'ร่าง พ.ร.ป.พรรคการเมือง (ก้าวไกล) (วาระ 1)'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/174/',
									description: 'ร่าง พ.ร.ป.พรรคการเมือง (คณะรัฐมนตรี) (วาระ 1)'
								},
								{
									link: 'https://theyworkforus.wevis.info/votelog/202/',
									description: 'แก้ไขร่าง พ.ร.ป. ส.ส. เรื่องการคำนวณบัญชีรายชื่อ'
								}
							]}
						/>
					</div>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="สถานะของกฎหมาย">สถานะของกฎหมาย</h2>
					<hr />
				</div>
			</section>
			<section>
				<h1 class="fluid-heading-05" id="ขั้นตอนการออกกฎหมายโดยรัฐสภา">
					ขั้นตอนการออกกฎหมายโดยรัฐสภา
				</h1>
				<div>
					<h2 class="fluid-heading-04" id="ขั้นตอนทั่วไป">ขั้นตอนทั่วไป</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="ขั้นตอนพิเศษของกฎหมายบางประเภท">
						ขั้นตอนพิเศษของกฎหมายบางประเภท
					</h2>
					<hr />
				</div>
			</section>
			<section>
				<h1 class="fluid-heading-05" id="เข้าใจการลงมติของ สส. และ สว.">
					เข้าใจการลงมติของ สส. และ สว.
				</h1>
				<div>
					<h2 class="fluid-heading-04" id="การลงมติคืออะไร เกิดขึ้นในขั้นตอนไหนบ้าง ?">
						การลงมติคืออะไร เกิดขึ้นในขั้นตอนไหนบ้าง ?
					</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="วิธีการลงมติ">วิธีการลงมติ</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="ประเภทการลงมติ">ประเภทการลงมติ</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="ผลการลงมติ">ผลการลงมติ</h2>
					<hr />
				</div>
			</section>
			<section>
				<h1 class="fluid-heading-05" id="ส.ส. และ ส.ว. ทำอะไรบ้างในสภา">
					ส.ส. และ ส.ว. ทำอะไรบ้างในสภา
				</h1>
				<div>
					<h2 class="fluid-heading-04" id="หน้าที่ของสมาชิกสภาผู้แทนราษฏร (สส.)">
						หน้าที่ของสมาชิกสภาผู้แทนราษฏร (สส.)
					</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="หน้าที่ของสมาชิกวุฒิสภา (สว.)">
						หน้าที่ของสมาชิกวุฒิสภา (สว.)
					</h2>
					<hr />
				</div>
				<div>
					<h2 class="fluid-heading-04" id="หน้าที่ของสภาร่วม (ส.ส. + ส.ว.)">
						หน้าที่ของสภาร่วม (ส.ส. + ส.ว.)
					</h2>
					<hr />
				</div>
			</section>
		</div>
		<div class="w-[250px]" />
	</main>
</div>

<style lang="postcss">
	section {
		@apply flex flex-col gap-4 bg-white px-4 md:px-0 py-8 md:py-0;
	}

	h1 {
		@apply text-text-primary mb-4;
	}

	h2 {
		@apply text-text-primary mb-4;
	}

	hr {
		@apply border-0 border-solid border-gray-20 border-t w-full box-border;
	}
</style>
